<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class CitySeeder extends Seeder
{
	/**
	 * Run the database seeds.
	 *
	 * @return void
	 */
	public function run()
	{
		$cities = [
			'თბილისი',
			'ბათუმი',
			'ქუთაისი',
			'რუსთავი',
			'გორი',
			'ზუგდიდი',
			'ფოთი',
			'ხაშური',
			'სამტრედია',
			'სენაკი',
			'ზესტაფონი',
			'მარნეული',
			'თელავი',
			'ახალციხე',
			'ქობულეთი',
			'ოზურგეთი',
			'კასპი',
			'ჭიათურა',
			'წყალტუბო',
			'საგარეჯო',
			'გარდაბანი',
			'ბორჯომი',
			'ტყიბული',
			'ხონი',
			'ბოლნისი',
			'ახალქალაქი',
			'გურჯაანი',
			'მცხეთა',
			'ყვარელი',
			'ახმეტა',
			'ქარელი',
			'ლანჩხუთი',
			'დუშეთი',
			'საჩხერე',
			'დედოფლისწყარო',
			'ლაგოდეხი',
			'ნინოწმინდა',
			'აბაშა',
			'წნორი',
			'თერჯოლა',
			'მარტვილი',
			'ხობი',
			'წალენჯიხა',
			'ვანი',
			'ბაღდათი',
			'ვალე',
			'ჩხოროწყუ',
			'თეთრიწყარო',
			'დმანისი',
			'ონი',
			'წალკა',
			'ამბროლაური',
			'სიღნაღი',
			'ცაგერი',
			'ჯვარი',
		];

		foreach ($cities as $city)
		{
			DB::table('cities')->insert([
				'name' => $city,
			]);
		}
	}
}
